# 注释  所有代码块语句必须包含相同的缩进空白数量
# 因此，在 Python 的代码块中必须使用相同数目的行首缩进空格数。
# 建议你在每个缩进层次使用 单个制表符 或 两个空格 或 四个空格 , 切记不能混用
# 1 定义整数，实数，字符串，数组，矩阵
counter = 100 # 赋值整型变量 a = b = c = 1
miles = 1000.0 # 浮点型  a, b, c = 1, 2, "john"
name = "John" # 字符串
del var1,name
#Python有五个标准的数据类型：Numbers（数字）String（字符串）List（列表）Tuple（元组）Dictionary（字典）
#Python支持四种不同的数字类型：int（有符号整型）long（长整型，也可以代表八进制和十六进制）float（浮点型）complex（复数）


# 2 字符串拼接，切割，矩阵拼接，切割
s = 'abcdef'
s[1:5]
'bcde'

print s + s    # 打印组合的列表


# 3 特别类型


# 4 循环

# 5 判断

# 6 函数


'''
这是多行注释，使用单引号。
这是多行注释，使用单引号。
这是多行注释，使用单引号。
'''